solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_CLKCTL2.h
/*! @name COMMONVDDNCLKSEL - VDDN_COM Clock Source Select */
/*! @{ */

#define CLKCTL2_COMMONVDDNCLKSEL_SEL_MASK        (0x3U)
#define CLKCTL2_COMMONVDDNCLKSEL_SEL_SHIFT       (0U)
/*! SEL - VDDN_COM Clock Source Select
 *  0b00..baseclk_comn
 *  0b01..main_pll_pfd3
 *  0b10..fro1_max
 *  0b11..osc_clk
 */
#define CLKCTL2_COMMONVDDNCLKSEL_SEL(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL2_COMMONVDDNCLKSEL_SEL_SHIFT)) & CLKCTL2_COMMONVDDNCLKSEL_SEL_MASK)
/*! @} */

/*! @name COMMONVDDNCLKDIV - VDDN_COM Clock Divider */
/*! @{ */

#define CLKCTL2_COMMONVDDNCLKDIV_DIV_MASK        (0xFFU)
#define CLKCTL2_COMMONVDDNCLKDIV_DIV_SHIFT       (0U)
/*! DIV - Clock Divider Value Selection */
#define CLKCTL2_COMMONVDDNCLKDIV_DIV(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL2_COMMONVDDNCLKDIV_DIV_SHIFT)) & CLKCTL2_COMMONVDDNCLKDIV_DIV_MASK)

#define CLKCTL2_COMMONVDDNCLKDIV_BUSY_MASK       (0x10000000U)
#define CLKCTL2_COMMONVDDNCLKDIV_BUSY_SHIFT      (28U)
/*! BUSY - Busy Flag
 *  0b0..The clkout is outputed with the new divider value.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL2_COMMONVDDNCLKDIV_BUSY(x)         (((uint32_t)(((uint32_t)(x)) << CLKCTL2_COMMONVDDNCLKDIV_BUSY_SHIFT)) & CLKCTL2_COMMONVDDNCLKDIV_BUSY_MASK)

#define CLKCTL2_COMMONVDDNCLKDIV_REQFLAG_MASK    (0x80000000U)
#define CLKCTL2_COMMONVDDNCLKDIV_REQFLAG_SHIFT   (31U)
/*! REQFLAG - Request Flag
 *  0b0..The change to the divider value has been finished.
 *  0b1..A change is being made to the divider value.
 */
#define CLKCTL2_COMMONVDDNCLKDIV_REQFLAG(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL2_COMMONVDDNCLKDIV_REQFLAG_SHIFT)) & CLKCTL2_COMMONVDDNCLKDIV_REQFLAG_MASK)
/*! @} */

/*! @name SYSOSCCTL0 - XTAL Oscillator Control 0 */
/*! @{ */

#define CLKCTL2_SYSOSCCTL0_LP_ENABLE_MASK        (0x1U)
#define CLKCTL2_SYSOSCCTL0_LP_ENABLE_SHIFT       (0U)
/*! LP_ENABLE - Low Power Mode Enable
 *  0b0..Enables High Gain mode (HP)
 *  0b1..Enables Low Power mode (LP)
 */
#define CLKCTL2_SYSOSCCTL0_LP_ENABLE(x)          (((uint32_t)(((uint32_t)(x)) << CLKCTL2_SYSOSCCTL0_LP_ENABLE_SHIFT)) & CLKCTL2_SYSOSCCTL0_LP_ENABLE_MASK)

#define CLKCTL2_SYSOSCCTL0_BYPASS_ENABLE_MASK    (0x2U)
#define CLKCTL2_SYSOSCCTL0_BYPASS_ENABLE_SHIFT   (1U)
/*! BYPASS_ENABLE - Bypass Enable
 *  0b0..Enables normal mode.
 *  0b1..Enables bypass mode. In this mode a clock can be directly inputted into the XTALIN pin.
 */
#define CLKCTL2_SYSOSCCTL0_BYPASS_ENABLE(x)      (((uint32_t)(((uint32_t)(x)) << CLKCTL2_SYSOSCCTL0_BYPASS_ENABLE_SHIFT)) & CLKCTL2_SYSOSCCTL0_BYPASS_ENABLE_MASK)
/*! @} */

/*! @name SYSOSCBYPASS - OSC Bypass Clock Source Select */
/*! @{ */

#define CLKCTL2_SYSOSCBYPASS_SEL_MASK            (0x3U)
#define CLKCTL2_SYSOSCBYPASS_SEL_SHIFT           (0U)
/*! SEL - SYSOSC Bypass Clock Select Source
 *  0b00..osc_out
 *  0b01..CLKIN
 *  0b10..Reserved
 *  0b11..Reserved
 */
#define CLKCTL2_SYSOSCBYPASS_SEL(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL2_SYSOSCBYPASS_SEL_SHIFT)) & CLKCTL2_SYSOSCBYPASS_SEL_MASK)
/*! @} */

/*! @name USBCLKSRC24MCLKSEL - USB0 Clock Source Select */
/*! @{ */

#define CLKCTL2_USBCLKSRC24MCLKSEL_SEL_MASK      (0x3U)
#define CLKCTL2_USBCLKSRC24MCLKSEL_SEL_SHIFT     (0U)
/*! SEL - USB0 24M Input Clock Select Source
 *  0b00..osc_clk
 *  0b01..fro_div8
 *  0b10..Reserved
 *  0b11..Reserved
 */
#define CLKCTL2_USBCLKSRC24MCLKSEL_SEL(x)        (((uint32_t)(((uint32_t)(x)) << CLKCTL2_USBCLKSRC24MCLKSEL_SEL_SHIFT)) & CLKCTL2_USBCLKSRC24MCLKSEL_SEL_MASK)
/*! @} */

/*! @name COMNBASECLKSEL - VDDN_COM Base Clock Source Select */
/*! @{ */

#define CLKCTL2_COMNBASECLKSEL_SEL_MASK          (0x3U)
#define CLKCTL2_COMNBASECLKSEL_SEL_SHIFT         (0U)
/*! SEL - Common Base Clock Source Select
 *  0b00..fro1_div3
 *  0b01..fro1_max
 *  0b10..fro0_div3
 *  0b11..1m_lposc
 */
#define CLKCTL2_COMNBASECLKSEL_SEL(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL2_COMNBASECLKSEL_SEL_SHIFT)) & CLKCTL2_COMNBASECLKSEL_SEL_MASK)
/*! @} */

/*! @name EUSBCLKSRC24MCLKSEL - USB1 (eUSB) Clock Source Select */
/*! @{ */

#define CLKCTL2_EUSBCLKSRC24MCLKSEL_SEL_MASK     (0x3U)
#define CLKCTL2_EUSBCLKSRC24MCLKSEL_SEL_SHIFT    (0U)
/*! SEL - 24M USB1 (eUSB) Input Clock Source
 *  0b00..osc_clk
 *  0b01..fro1_div8
 *  0b10..Reserved
 *  0b11..Reserved
 */
#define CLKCTL2_EUSBCLKSRC24MCLKSEL_SEL(x)       (((uint32_t)(((uint32_t)(x)) << CLKCTL2_EUSBCLKSRC24MCLKSEL_SEL_SHIFT)) & CLKCTL2_EUSBCLKSRC24MCLKSEL_SEL_MASK)
/*! @} */

/*! @name MAINPLL0CLKSEL - Main PLL0 Clock Source Select */
/*! @{ */

#define CLKCTL2_MAINPLL0CLKSEL_SEL_MASK          (0x3U)
#define CLKCTL2_MAINPLL0CLKSEL_SEL_SHIFT         (0U)
/*! SEL - Main PLL0 Clock Select Source
 *  0b00..fro1_div8
 *  0b01..osc_clk
 *  0b10..Reserved
 *  0b11..Reserved
 */
#define CLKCTL2_MAINPLL0CLKSEL_SEL(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0CLKSEL_SEL_SHIFT)) & CLKCTL2_MAINPLL0CLKSEL_SEL_MASK)
/*! @} */

/*! @name MAINPLL0CTL0 - Main PLL0 Control 0 */
/*! @{ */

#define CLKCTL2_MAINPLL0CTL0_BYPASS_MASK         (0x1U)
#define CLKCTL2_MAINPLL0CTL0_BYPASS_SHIFT        (0U)
/*! BYPASS - MAINPLL0 BYPASS
 *  0b0..PFD outputs are PFD-programmed clocks.
 *  0b1..Bypass mode: PFD outputs are sourced directly from the reference input clock.
 */
#define CLKCTL2_MAINPLL0CTL0_BYPASS(x)           (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0CTL0_BYPASS_SHIFT)) & CLKCTL2_MAINPLL0CTL0_BYPASS_MASK)

#define CLKCTL2_MAINPLL0CTL0_RESET_MASK          (0x2U)
#define CLKCTL2_MAINPLL0CTL0_RESET_SHIFT         (1U)
/*! RESET - MAINPLL0 Reset
 *  0b0..MAINPLL0 reset is removed.
 *  0b1..MAINPLL0 is placed into reset.
 */
#define CLKCTL2_MAINPLL0CTL0_RESET(x)            (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0CTL0_RESET_SHIFT)) & CLKCTL2_MAINPLL0CTL0_RESET_MASK)

#define CLKCTL2_MAINPLL0CTL0_HOLD_RING_OFF_ENA_MASK (0x2000U)
#define CLKCTL2_MAINPLL0CTL0_HOLD_RING_OFF_ENA_SHIFT (13U)
/*! HOLD_RING_OFF_ENA - Hold Ring Off Control
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL2_MAINPLL0CTL0_HOLD_RING_OFF_ENA(x) (((uint32_t)(((uint32_t)(x)) << CLKCTL2_MAINPLL0CTL0_HOLD_RING_OFF_ENA_SHIFT)) & CLKCTL2_MAINPLL0CTL0_HOLD_RING_OFF_ENA_MASK)

